const ru = {

	langCode: 'RU',
	versiyon: 'Версия',
	versiyonTarihi: 'Дата Версии',
	baslik: 'Витрина Пользовательского интерфейса',

	anaBaslik: 'Компоненты Пользовательского интерфейса Карчин',

	nasilKullanilir: 'Как используется?',
	uiBilesenleri: 'КОМПОНЕНТЫ ПОЛЬЗОВАТЕЛЬСКОГО ИНТЕРФЕЙСА',
	httpBilesenleri: 'КОМПОНЕНТЫ ЗАПРОСА HTTP',

	getStarted: 'Давайте Начнем! 🚀',

	anaMetin: 'Берущий силу у таких сильных компонентов, как React и TypeScript <b>карчин-ui</b>, в период разработки интерфейса, включает в себя некотровые компоненты, которые могут вам помочь. Кроме того, мы продолжаем добавлять новые компоненты и обновлять имеющиеся.',
	npmileKurun: 'Посредством NPM <b>карчин-ui</b> добавьте пакет в ваш проект.',
	hizliBirOrnek: 'Быстрый Пример',
	buttonOrnekMetin: 'Необходимые вам компененты переведите внутрь. <b>Кнопка</b> Бытро посмотрим, как компоненты переводятся внутрь и как используются.',

	ornekler: 'Примеры',
	ozellikleri: 'Особенности',
	kaynakKod: 'Исходный код',
	ikonDonusturme: 'Преобразование Значков',

	buttonMetin: 'В элементах формы, в пользовательских активациях и во многих других местах <b>карчин-ui</b> Используйте компонент кнопки. Поддерживает большой выбор цвета и разные габариты. В то же время в левую часть, можете добавить специальные значки.',

	basitKullanim: 'Простое Использование',
	farkliBoyutlardaKullanim: 'Использование в Различных Размерах',
	ikonBeraberKullanim: 'Использование Вместе со значком',
	ikonBeraberKullanimMetin: 'Когда вы хотите использовать компоненты кнопки вместе со значком какой-нибудь значок SVG, дающийся параметром значка с легкостью можете использовать. Имеющиеся значки SVG <a href="https://react-svgr.com/" target="_blank">SVGR</a> посредством, можете привести в состояние реактивного компонента. Между верхними вкладками <b>"Преобразование Значка"</b> из вкладки можете взглянуть на образцовый документ.',
	sadeceIkonKullanim: 'Только Использование Значка',
	etkilesimliKullanim: 'Интерактивное Использование',
	devreDisiKullanim: 'Отключенное Использование',
	classNameKullanim: 'Использование Вместе с Индивидуальным Селектором',
	classNameKullanimMetin: 'Компоненту кнопки <b>"классназвание"</b> давая параметры, вы может назначить, желаемые индивидуальные стили.',
	tamGenislikKullanim: 'Использование Полной Ширины',

	ikonDonusturmeBaslangic: 'Прежде всего пакет  SVGR, добавим в проект, как "devDependencies" (гигантская зависимость).',
	ikonDonusturmeSVG: 'Как и внизу, представим, что файл SVG у нас имеется. Нзвание нашего файла SVG: apple.svg',
	ikonDonusturmeCommand: 'В одном каталоге с нашим файлом SVG, запустим нижний код.',
	ikonDonusturmeAlert: 'Так как мы используем TypeScript, параметром распечатки дан "tsx". Детальные использование, будут доступны на веб сайте пакета SVGR.',
	ikonDonusturmeApple: 'Как распечатка этого кода будет создана папка Icons. Внутри же нее будут созданы два файла под названием - Apple.tsx и index.tsx. У нас появился новый значок, который мы можем использовать в Button и еще больших компонентахz. 👍',
	ikonDonusturmeSonuc: 'Содержание файла Apple.tsx такое же, как и выше.',

	propertyName: 'Название Особенности',
	required: 'Обязательное поле',
	type: 'Тип',
	description: 'Описание',

	requiredWrite: 'Обязательное',
	optionalWrite: 'По желанию',

	propsText: 'Текст для отображения.',
	propsButtonIcon: "Может получить значок или вращение 'spin'.",
	propsFull: 'Определит полностью широкий или нет.',
	propsDisable: 'Определит активный или нет.',
	propsClassName: 'Поддерживает использование с индивидуальным селектором.',
	propsOnClick: 'Это значение функции, которое будет запускаться при нажатии.',

	alertMetin: 'Успех, ошибка, предупреждение или в случае, если хотите отправить информционное сообщение используйте.',

	bottomInfoMetin: 'Под компонентами, используйте для определения значения, соответсвующих цветов.',
	propsBottomInfoValues: 'Как цвет кода, поддерживаются  форматы string, rgb, rgba или  hexadecimal.',

	dataGridMetin: 'Используйте для аккуратного составления порядковых данных. Поддерживает такие особенности как, фильтрация, поиск и перемещение.',
	detayliKullanim: 'Детальное Использование',

	olusturulmaTarihi: 'Дата Создания',
	binaKodu: 'Код Здания',
	binaAdi: 'Название Зданияı',
	binaAktif: 'Активен ли статус здания?',
	aktif: 'Активный',
	pasif: 'Пассивный',
	yeniekle: 'Добавить Новое',
	guncelle: 'Обновить',
	sil: 'Удалить',

	gorselBeraberKullanim: 'Использование Вместе С Картинкой',
	propsDataGridColumn: 'Укажет на особенности заголовка.',
	propsDataGridRow: 'Вместе с названиями, указанными в заголовке, заполнение компонентов данными являются особенностями.',
	propsDataGridButtons: 'Кнопка, которая будет создана в правой верхней части, обеспечит ваше управление.',
	propsDataGridOnSelected: 'При выборе строки над компонентом Data Grid это вызванное значение функции.',
	propsDataGridReSelected: 'При удалении значения выбора над компонентом Data Grid это вызванное значение функции. При удалении выбора строки, и тут же при выборе другой строки не будет вызвано.',
	propsDataGridNoFit: 'Компонент Data Grid придет по умолчанию, с зафиксированной широтой. Если пожелаете, можете с особенностью noFit использовать со смещением в сторону.',

	headerTabMetin: 'Обычно используется для создания в верхней части страницы tab. Но, используя вместе с индивидуальным селектором преобразовывая в желаемый дизайн, в любом месте страницы можете использовать.',
	
	propsHeaderTabActiveTab: 'Используется, для указания активной вкладки.',
	propsHeaderTabChangeTab: 'При нажатии какой-либо между вкладок, вызывет значение функции.',
	propsHeaderTabTabs: 'Тексты, показывающиеся во всех вкладках будут определены здесь.',

	layoutMetin: 'Используйте содержания для показа, в аккуратной коробке.',
	buttonBeraberKullanim: 'Используйте вместе с Кнопкой',
	switchBeraberKullanim: 'Используйте вместе с Переключателем',
	yaziBeraberKullanim: 'Использование с Текстом',
	yaziButtonBeraberKullanim: 'Использование Текста С Кнопкой',
	icerikBeraberKullanim: 'Использование с настройкой области содержимого',

	propsChildren: 'Укажет, используемую, как содержимое область.',
	propsTitle: 'Укажет выражение заголовка.',
	propsRightType: 'Укажет тип области выражения заголовка в правой стороне.',
	propsRightText: 'Укажет содержание области правого текста.',
	propsRightButtonState: 'Если в правую часть добавлена Кнопка или переключатель, укажет статус соотвествующего компонента.',
	propsRightButtonFunction: 'Если в правую часть добавлена Кнопка, или Переключатель или TextButton, вызванное значение функции.',
	propsRightButtonText: 'Если в правую часть добавлена Кнопка, укажет надпись на Кнопке.',
	propsContentStyle: 'При желании настроек области содержания дав объект CSS, можете использовать в желаемом дизайне.',

	loadingMetin: 'Используйте загрузку анимаций в необходимых местах.',
	farkliKullanim: 'Использовать с разными картинками',
	dilDegisimKullanim: 'Использование Для Изменения Языков',

	logPanelMetin: 'Имеет красивый дизайн, зафиксированных в нижней части и обновленных записей журнала <b>карчин-ui</b> Используйте компоннет панели журнала. К примеру из запросов HTTP или для показа ответов, приходящих через WebSocket очень полезный в использовании компонент.',

	propsSubTitle: 'Укажет значение нижнего заголовка.',
	propsRightTitle: 'Укажет область текста нижнего выражения заголовка, в правой части.',
	propsHeight: 'Если вы захотите дать компоненту зафиксированную высоту, позволит вам дать ее как строку.',

	modalMetin: 'Используйте для показа окна, на имеющейся странице. Лучшее решение, которое может быть использовано для обновления или операций по удалению! Кроме того, поддерживает такие особенности как, полноэкранный режим, перенос и показ iFrame. 👍',

	altBeraberKullanim: 'Использование вместе с нижней частью',
	iFrameBeraberKullanim: 'Использование вместе с iFrame',
	farkliGenislikKullanim: 'Использование Вместе С Различной Широтой',

	propsOpened: 'Укажет статус открыт или закрыт модального компонента. Вначале рекомендуется быть закрытым.',
	propsClose: 'При нажатии кнопки закрыть, в правой верхней части модального компонента, будет вызвано значаение функции.',
	propsFooter: 'Поможет расставить, в нижней части модального компонента и любые желаемые реактивные элементы.',
	propsiFrame: 'Поможет использовать модальный компонент с iFrame.',
	propsExpand: 'Определит быть или не быть полноэкранному режиму.',
	propsWidth: 'Когда вы захотите придать компоненту зафиксированную широту,  придает широту в виде строки - string.',
	propsNoScroll: 'Определит есть ли прокрутка внутри модального компанента. Прокрутка может использоваться, будучи включеной по умолчанию.',

	notifyMetin: 'В правой верхней части страницы, когда хотите дать уведомление об успехе, ошибке, предупреждении или информационное сообщение  используйте.',
	sureKullanim: 'Использовать со временем',

	inputMetin: 'Используйте, когда хотите получить от пользователя текстовые данные. Поддерживает тип пароля и в правой части значок.',
	baslikKullanim: 'Использовать с заголовком',
	hataliBeraberKullanim: 'Использоване в ошибочных ситуациях',
	sifreBeraberKullanim: 'Использование для пароля',
	onKeyPressBeraberKullanim: 'Использование при обнаружении ситуации onKeyPress, нажатие клавиши',
	onKeyMetin: "Прверить экран приставки, для всех результатов. При нажатии клавиши Enter вас ожидает Уведомление",
	
	propsColor: 'Укажет значения, которые может принимать как цвет.',
	propsSize: 'Укажет значения, которые может принимать, как размер.',
	propsType: 'Укажет значения которые может принимать для типа.',

	propsInputValue: 'Укажет, знаечение, которое было введено как содержание.',
	propsOnChange: 'При каком-либо измении значения, вызывает значение функции.',
	propsIcon: 'Когда вы хотите использовать значок, укажет используемое значение.',
	propsPlaceholder: 'Когда значение пусто, задает значение, которое будет отображаться затемненным.',
	propsError: 'В ошибочных ситуациях, укажет значение ошибки.',
	propsErrorChange: 'Когда в значении происходит какое-то изменение, если значения прежней и нынешней ошибки различные, вызывает значение функции.',
	propsErrorText: 'Позволит настроить текст ошибки.',

	textareaMetin: 'Используйте, когда хотите получить от пользователей длинные тексты.',
	radioButtonMetin: 'Используйте, когда хотите выбрать только один, среди нескольких вариантов.',
	dikeyKullanim: 'Вертикальное Использование',

	propsValues: 'Укажет значения, которые были введены, как содержание.',

	checkListMetin: 'Используйте, когда  среди нескольких вариантов, хотите выбрать больше одного.',
	singleCheckMetin: 'Используйте в таких ситуациях, как правильно или не правильно.',

	datePickerMetin: 'Используйте, когда хотите получить от пользователей данные о дате.',
	timePickerMetin: 'Используйте, когда хотите получить от пользователей данные о времени.',
	selectInputMetin: 'Используйте, когда хотите выбрать только один, из открывающейся области и среди нескольких вариантов.',
	fileInputMetin: 'Используйте когда хотите, чтобы пользователь загрузил какой-нибудь файл.',
	startEndIpAddressInputkMetin: 'Используйте, когда хотите получить адрес данные адреса IP Начала и Завершения.',

	propsStartIP: 'Укажет информацию адреса IP Начало, введенного как содержание.',
	propsEndIP: 'Укажет информацию Окончания адреса IP, введенного как значение.',
	propsStartIPChange: 'Когда в значениие Начального адреса IP, произошло изменнеие, вызвано значение функции.',
	propsEndIPChange: 'Когда в значении Завершенного адреса IP произошло изменнеие, вызвано значение функции.',

	diagramMetin: 'Используйте для построения конструкции вложенной спирали, или диаграммы, пренадлежащей какому-нибудь учреждению.',
	propsNodeTemplate: 'Укажет, используемую для диаграммы конструкцию дизайна.',

	dashboardCardMetin: 'Используйте, для показа статистических данных на целевой странице или на похожих страницах.',
	simpleGaugeMetin: 'Используйте для показа статистических данных в процентах. Понижение или повышение значения прроцента поддержит анимация.',

	propsIconColor: 'При использовании значка, укажет значения значка, которые можно принять ка цвет.',
	propsLabels: 'Укажет выражение заголовка правой и левой стороны графика.',
	propsLabelsColor: 'Укажет выражение заголовка,  правой и левой стороны графика, принятые как цвет.',
	propsPercent: 'Укжет процентное значение графика.',

	pieMetin: 'Используйте для показа статистических данных на круговой диаграмме.',
	propsLineWidth: 'Укажет размер краев графика.',
	propsCenter: 'Укажет содержание  средней части графика.',

	singlePieMetin: 'Используйте для показа данных сингулярной статистики, на круговой диаграмме. При понижении и повышении процентного значение, поддреживается анимацией.',
	lineMetin: 'Используйте для показа данных на линейном графике.',
	farkliSadeceKullanim: 'Различное Использование',

	propsEnableArea: 'Укажет статус области, оставшейся внизу графика.',
	propsMin: 'Укажет начальную точку графика.',
	propsMax: 'уажет конечную точку графика.',
	propsGridYValues: 'Укажет расположение горизонтальных линий графика.',
	propsAreaOpacity: 'Укажет непрозрачность нижней области графика.',
	propsPointSize: 'Укажет размер точек.',
	propsTooltipCharacter: 'Укажет текст аннотации на какой-либо точке.',

	tableMetin: 'Используйте для состовления правильного списка порядковых данных.',
	ozellestirilmisKullanim: 'Использование с настроенными данными',
	propsTextOverflow: 'В случае,когда данные не поместились в данную область широты, укажет, ставить ли в конец текстов многоточие.',
	propsScrollType: 'Укажет тип высоты, когда на диаграмме будет строиться горка.',
	propsScrollHeight: 'Обеспечит высоту по мере типа высоты, то есть зафиксированная высота или высота согласна количеству строк.',
	kaydirmaKullanim: 'Использование с Горкой',
	propsHorizontalScroll: 'Укажет на диаграмме будет или нет горизотальная горка.',
	yatayKaydirmaKullanim: 'Использование с Горизонтальной Горкой',
	tableKullanim: 'Использование с Компонентом Таблицы',
	propsReferenceLine: 'Укажет быть или не быть на графике, справочной линии.',
	propsLineColor: 'Укажет значения, принятых как цвет на графике, справочных линий.',
	propsLinePosition: 'Укажет на графике процентное значение справочных линий.',
	
	propsFirstColumnFreeze: 'В случае, когда горизонтальная горка, укажет фиксацию первой руки.',
	propsNoDataContent: 'Поддержит показ настроенных данных, при отсутствии данных внутри компонента таблицы.',
	propsTableFooter: 'Поддержит показ настроенных данных в нижней части компоннета таблицы.',

	yatayKaydirmaSabitKullanim: 'Использование Горизонтальной Горки и Зафиксированного столбца',
	noDataContentKullanim: 'Использование с настроенным содержанием, при отсутсвии данных',
	footerKullanim: 'Использование с Нижней Частью',

	propsTooltip: 'Когда дело доходит до компонента, укажет видимость или не видимость поля описания.',
	propsTotalCount: 'Укажет видимость общего количества записей в таблице компонентов.',
	
	barMetin: 'Используйте показа данных на гистограмме.',
	propsPadding: 'Укажет значение пустоты между стержней.',
	propsTickRotation: 'Укажет угловое значение в нижней информационной части.',
	propsTooltipBrackets: 'Укажет текст скобки, пришедшей на какой-либо точке.',
	propsEnableLabel: 'Укажет есть ли текст на гистограмме.',
	propsLabel: 'Укажет значение выражения текста на гистограмме.',
	propsLabelTextColor: 'Укажет значение цвета, выраженного текста на гистограмме.',

	propsCreate: 'Укажет первые особенности, используемые для Диаграммы.',
	propsLinkTemplate: 'Укажет структуру соединения, используемую для Диаграммы.',
	propsModel: 'Укажет структуру модели, используемую для Диаграммы.',

	ustCubukLoadingKullanim: 'Использование Нагрузки на Верхнюю Панель',
	lookUpMetin: 'Используйте, если хотите через открытое подробное поле, и среди больше одного вариантов, выбрать только один.',
	propsPropertyLabel: 'Укажет особенность названия ярлыка, внутри данных.',
	propsPropertyValue: 'Укажет особенность ценности внутри данных.',

	propsDataGridRowDoubleClicked: 'Два раза щелкнув на строку компонента сетки данных, вызовите значение функции.',
	dataFilterMetin: 'Используйте в случае, если хотите сделать фильтрацию.',
	propsProperties: 'Укажет особенности значения сделанных фильтраций.',
	result: 'Результат',
	cokluSecimKullanim: 'Использование Множественного Выбора',
	propsDataGridMultiple: 'Компонент сетки данных, по умолчанию, предоставит возможность сделать единственный выбор. Если пожелаете, с особенностью  multiple можете сделать множественный выбор.',

	sabitKullanim: 'Постоянное Использованное',

	propsHourMin: 'Укажет самое низкое значение выражения часа.',
	propsHourMax: 'Укажет самое большое значение выражения часа.',
	propsHourStep: 'Укажет частоту изменения выражения часа.',
	propsMinuteMin: 'Укажет самое маленькое значение выражение минуты.',
	propsMinuteMax: 'Укажет самое большое значение выражения минуты.',
	propsMinuteStep: 'Укажет частоту изменения выражения минуты.',

	mapMetin: 'Используйте данные для показа их на карте.',
	araclar: 'ИНСТРУМЕНТЫ',
	requestMetin: 'Обеспечит управление отправленных удаленному серверу, с запросов HTTP, и вернувшихся данных.',
	getKullanim: 'Использование GET',
	postKullanim: 'Использование ПОЧТЫ',
	webSocketMetin: 'Использовать для ловли оптимизированных мгновенных сообщений.',
	
	agacKullanim: 'Использование В Форме Дерева',
	propsDataGridTreeData: 'Обеспечит возможность использования в форме дерева компонент сетки данных.',
	propsDataGridGetDataPath: 'Если компонент сетки данных будет использован как дерево, укажет направление данных.',
	propsDataGridAutoGroupColumnDef: 'Если компонент сетки данных будет использоваться как дерево, укажет особенность группирповки колонн.',

	phoneNumberMetin: 'Используйте, когда хотите взять номер телефона у пользователя. Поддерживает коды стран.',

	propsDataGridMasterDetail: 'Обеспечит возможность владения  всплывающей области данных компонента сетки данных.',
	propsDataGridCustomDetail: 'Если данные владеют особенностью всплывающей области, определит приходящее в ту область выражение.',
	propsDataGridDetailRowHeight: 'Если данные владеют особенностью всплывающей области, определит высоту той области.',

	propsisMulti: 'Компонент Select Input, будучи по умолчанию, обеспечит возможность, сделать единственный выбор. Если пожелаете, с особенностью  multiple можете сделать множественный выбор.',

	propsDataGridDefaultSelectedName: 'Будучи по умолчанию определит название линии выбора.',
	propsDataGridDefaultSelectedValue: 'Будучи по умолчанию определит значение линии выбора.',

	calendarMetin: 'Отличный компонент для отслеживания запланированной задачи, на большом календаре.',

	propsEvents: 'Определит события показанные на компоненте календаря.',
	propsOnSelectEvent: 'При нажатии на событие, вызывает значение функции.',
	propsOnSelectSlot: 'При выборе определенной области, вызывает значение функции.',
	propsOnEventDrop: 'При переносе, и упущении события, вызывает значение функции.',
	propsStep: 'Определит временные интервалы компонента календаря.',
	propsTimeslots: 'Определит часовые интервалы компонента календаря.',
	propsEventPropGetter: 'Поддержит вмешательство в имеющийся дизайн события.',

	progressMetin: 'Использовать для показа процента загрузки на стержне.',
	renkliKullanim: 'Использовать В Различных Цветах',

	propsProgressPercent: 'Определит значение полученное в процентах.',
	propsProgressTitle: 'Определит значение написанного на стержне текста. По умолчанию покажет выражение процента.',
	propsNoTitle: 'Определит есть ли какой-нибудь текст на стержне.',
	propsTitleColors: "Определит из каких цветов будет состоять  %50 снизу и на верху, выражения текста на стержне.",
	propsProgressHeight: 'Определит данные компоннету, зафиксированное значение высоты.',
	propsStripe: 'Определит есть ли особенности полосы.',
	propsStripeSize: 'Определит промежуток свойств полосы.',
	propsAnimated: 'Вместе с особенностями полос определит, анимационные или нет.',
	propsProgressColor: 'Поддержит изменнеие цвета процентной части.',
	propsInfinity: 'Создаст компонент, все время текущий в анимационной форме.',

	maskeKullanim: 'Использование Маскируя',
	propsMask: 'Поддержит на введенном данном маскировку.',
	propsOpen: 'Определит открыт или нет, вначале компонент панели.',

	otomatikBoyutKullanim: 'Использовать С Автоматическим РазмеромOtomatik Boyut ile Kullanım',
	offsetKullanımi: 'Использование Offset',
	icIceKullanim: 'Вложенное Использование',
	dikeyOrtalamaKullanim: 'Использование С Сертикальной Средней',
	boslukSifirlamaKullanim: 'Использование С Обнулением Пустоты',
	ozellestirilmisBoslukKullanim: 'Использование С Индивидуальной Пустотой',

	propsRowNoGutter: 'Обнулит значение пустоты между столбцами.',
	propsRowMiddle: 'Центрирует столбцы по вертикальной оси.',
	propsRowGutter: 'Определит значение пустоты между столбцами.',

	propsColXs: 'Определит  ширину столбца на очень маленьких экранах.',
	propsColSm: 'Определит ширину столбца на маленьких экранах.',
	propsColMd: 'Определит ширину столбца на экране планшета.',
	propsColLg: 'Определит ширину столбца на больших экранах.',
	propsColXl: 'Определит ширину столбца на дополнительно больших экранах.',

	gridMetin: 'Используйте для создания правки страницы.',

	propsHideOnDayClick: 'Определит откроется или нет область календаря, при выборе даты.',
	propsDisableDayBefore: 'Обеспечит пассивность дней до указанной даты.',
	propsDisableDayAfter: 'Обеспечит пассивность дней после указанной даты.',

	queryBuilderMetin: 'Используйте для фильтрации, согласно определенным условиям.',
	propsRule: 'Обеспечит начало со списком правил по умолчанию.',

	sayfalamaKullanim: 'Использование с Пейджингом',
	propsDataGridPagination: 'Обеспечит возможность использования компонента сетки данных, с функцией Пейджинга.',
	propsDataGridPaginationPageSize: 'Если компонент сетки данных будет использован с пейджингом, будет определено количество данных для пейджинга.',

	ornekKullanim: 'Образец Использования',

	confirmMetin: 'Используйте для получения согласия в окне имеющейся страницы.',
	propsButtonIconSimple: 'Определит значения принимаемые как значок.',
	propsButtons: 'Определит принимаемые компоненты кнопки.',

	sketelonLoadingMetin: 'Для имеющихся компонентов загрузку анимаций в форме скелета используйте в необходимых местах.',
	tableBasitKullanim: 'Простое Использование для Таблицы',
	buttonBasitKullanim: 'Простое Использование для Кнопки',

	tooltipMetin: 'Используйте для показа информационного ящика, открывшегося вокруг объектов.',
	propsId: 'Определит уникальное значение.',

	dropdownMetin: 'Используйте для показа информационного ящика, открывающегося вокруг объектов или интерактивных компонентов.',
	propsDanger: 'Определит опасен или нет.',
	propsIconless: 'Определит спрятан ли компонент значка на нем.'

};

export default ru;